Белгипрозем_2017/src/InformationRegisters/ПараметрыВидовРаботПоДоговорам/ПараметрыВидовРаботПоДоговорам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыВидовРаботПоДоговорам</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ПредУсловие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПостУсловие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДнейПоГороду</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДнейПоОбласти</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидДней</name>
    <type>
      <types>EnumRef.ВидыДней</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДнейПоГородуСовместно</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДнейПоОбластиСовместно</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДниДополнительно</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗемлепользователейБольше5</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидРабот</name>
    <type>
      <types>CatalogRef.мВидыРаботЮрЛица</types>
      <types>CatalogRef.мВидыРаботФизЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/InformationRegisters/ПараметрыВидовРаботПоДоговорам/ManagerModule.bsl
Функция ПолучитьПараметрыВидаРабот(ВидРабот, ЮрФизЛицо, ДатаСреза) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПараметрыВидовРаботПоДоговорамСрезПоследних.ПредУсловие,
		|	ПараметрыВидовРаботПоДоговорамСрезПоследних.ПостУсловие,
		|	ПараметрыВидовРаботПоДоговорамСрезПоследних.ДнейПоГороду,
		|	ПараметрыВидовРаботПоДоговорамСрезПоследних.ДнейПоОбласти,
		|	ПараметрыВидовРаботПоДоговорамСрезПоследних.ВидыДней,
		|	ПараметрыВидовРаботПоДоговорамСрезПоследних.ЕдиницаИзмерения
		|ИЗ
		|	РегистрСведений.ПараметрыВидовРаботПоДоговорам.СрезПоследних(&ДатаСреза, ) КАК ПараметрыВидовРаботПоДоговорамСрезПоследних
		|ГДЕ
		|	ПараметрыВидовРаботПоДоговорамСрезПоследних.ВидРаботыПоДоговору = &ВидРаботыПоДоговору
		|	И ПараметрыВидовРаботПоДоговорамСрезПоследних.ЮрФизЛицо = &ЮрФизЛицо";

	Запрос.УстановитьПараметр("ВидРаботыПоДоговору", ВидРабот);
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("ЮрФизЛицо", ЮрФизЛицо);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	СтруктураПараметров = Новый Структура("ПредУсловие, ПостУсловие, ДнейПоГороду, ДнейПоОбласти, ВидыДней, ЕдиницаИзмерения");
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураПараметров, ВыборкаДетальныеЗаписи);	
	КонецЕсли;
    Возврат СтруктураПараметров;
КонецФункции
